<!-- add-pr-comment:manifest_secrets_plan -->

# staging/manifest_secrets Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_secretsmanager_secret.manifest_enable_new_relic will be created
  + resource "aws_secretsmanager_secret" "manifest_enable_new_relic" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_ENABLE_NEW_RELIC"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + region                         = "ca-central-1"
      + tags_all                       = (known after apply)
      + replica (known after apply)
    }
  # aws_secretsmanager_secret_version.manifest_enable_new_relic_version will be created
  + resource "aws_secretsmanager_secret_version" "manifest_enable_new_relic_version" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + region               = "ca-central-1"
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }
Plan: 2 to add, 0 to change, 0 to destroy.

# --- End of Plan 1 ---